problem link: https://leetcode.com/problems/investments-in-2016/description/?lang=pythondata

In [1]:
import pandas as pd

### Generating test cases

In [26]:
insurance=pd.read_csv('./test_data/p585_insurance.csv',delimiter='|')
insurance

   pid  tiv_2015  tiv_2016  lat  lon
0    1        10         5   10   10
1    2        20        20   20   20
2    3        10        30   20   20
3    4        10        40   40   40

In [27]:
insurance.dtypes

pid         int64
tiv_2015    int64
tiv_2016    int64
lat         int64
lon         int64
dtype: object

In [28]:
insurance.columns

Index(['pid', 'tiv_2015', 'tiv_2016', 'lat', 'lon'], dtype='object')

### Solving problem

In [29]:
insurance=insurance.astype({'lat':'str','lon':'str'})
insurance

   pid  tiv_2015  tiv_2016 lat lon
0    1        10         5  10  10
1    2        20        20  20  20
2    3        10        30  20  20
3    4        10        40  40  40

In [31]:
insurance.dtypes

pid          int64
tiv_2015     int64
tiv_2016     int64
lat         object
lon         object
dtype: object

In [32]:
insurance['lat-lon']=insurance.lat+'-'+insurance.lon
insurance

   pid  tiv_2015  tiv_2016 lat lon lat-lon
0    1        10         5  10  10   10-10
1    2        20        20  20  20   20-20
2    3        10        30  20  20   20-20
3    4        10        40  40  40   40-40

In [ ]:
#checking whether duplicate exists for location
insurance['is_loc_duplicate']= insurance['lat-lon'].duplicated(keep=False)
insurance

   pid  tiv_2015  tiv_2016 lat lon lat-lon  is_loc_duplicate
0    1        10         5  10  10   10-10             False
1    2        20        20  20  20   20-20              True
2    3        10        30  20  20   20-20              True
3    4        10        40  40  40   40-40             False

In [ ]:
#checking whether duplicate exists for investments for 2015
insurance['is_tiv_2015_duplicate']= insurance['tiv_2015'].duplicated(keep=False)
insurance

,pid,tiv_2015,tiv_2016,lat,lon,lat-lon,is_loc_duplicate,is_tiv_2015_duplicate
0,1,10,5,10,10,10-10,False,True
1,2,20,20,20,20,20-20,True,False
2,3,10,30,20,20,20-20,True,True
3,4,10,40,40,40,40-40,False,True

In [48]:
#Filtering a) Those who have similar investment like others b) those who haven ubique location
insurance=insurance[(insurance.is_loc_duplicate==False) & (insurance.is_tiv_2015_duplicate==True)]
insurance

,pid,tiv_2015,tiv_2016,lat,lon,lat-lon,is_loc_duplicate,is_tiv_2015_duplicate
0,1,10,5,10,10,10-10,False,True
3,4,10,40,40,40,40-40,False,True

In [47]:
pd.DataFrame(pd.Series(round(insurance.tiv_2016.sum(),2)).rename('tiv_2016'))

   tiv_2016
0        45

### Preparing Submission function

In [49]:
import pandas as pd

def find_investments(insurance: pd.DataFrame) -> pd.DataFrame:
    insurance=insurance.astype({'lat':'str','lon':'str'})
    insurance['lat-lon']=insurance.lat+'-'+insurance.lon

    #checking whether duplicate exists for location
    insurance['is_loc_duplicate']= insurance['lat-lon'].duplicated(keep=False)

    #checking whether duplicate exists for investments for 2015
    insurance['is_tiv_2015_duplicate']= insurance['tiv_2015'].duplicated(keep=False)

    #Filtering a) Those who have similar investment like others b) those who haven ubique location
    insurance=insurance[(insurance.is_loc_duplicate==False) & (insurance.is_tiv_2015_duplicate==True)]

    return pd.DataFrame(pd.Series(round(insurance.tiv_2016.sum(),2)).rename('tiv_2016'))

### Testing the submission function

In [50]:
insurance=pd.read_csv('./test_data/p585_insurance.csv',delimiter='|')
insurance

   pid  tiv_2015  tiv_2016  lat  lon
0    1        10         5   10   10
1    2        20        20   20   20
2    3        10        30   20   20
3    4        10        40   40   40

In [51]:
find_investments(insurance=insurance)

   tiv_2016
0        45